In [3]:
import pandas as pd
data = {
    "ID": [101, 102, 103, 104, 105],
    "Name": ["Alice", "Bob", "Charlie", "David", "Emma"],
    "Age": [25, 30, 22, 28, 27],
    "Department": ["HR", "IT", "Finance", "Marketing", "Sales"],
    "Salary": [50000, 60000, 55000, 58000, 62000]
}
df = pd.DataFrame(data)
df

    ID     Name  Age Department  Salary
0  101    Alice   25         HR   50000
1  102      Bob   30         IT   60000
2  103  Charlie   22    Finance   55000
3  104    David   28  Marketing   58000
4  105     Emma   27      Sales   62000

In [7]:
#Get The Dimentions of the dataframe
df.shape

(5, 5)

In [9]:
rows, columns = df.shape

In [11]:
rows

5

In [13]:
columns

5

In [15]:
#Printing the initial few rows
df.head()

    ID     Name  Age Department  Salary
0  101    Alice   25         HR   50000
1  102      Bob   30         IT   60000
2  103  Charlie   22    Finance   55000
3  104    David   28  Marketing   58000
4  105     Emma   27      Sales   62000

In [17]:
#Printing the intial 3 rows
df.head(3)

    ID     Name  Age Department  Salary
0  101    Alice   25         HR   50000
1  102      Bob   30         IT   60000
2  103  Charlie   22    Finance   55000

In [19]:
#Printing the final 3 rows
df.tail(3)

    ID     Name  Age Department  Salary
2  103  Charlie   22    Finance   55000
3  104    David   28  Marketing   58000
4  105     Emma   27      Sales   62000

In [21]:
#Slicing on dataframe
df[1:4]

    ID     Name  Age Department  Salary
1  102      Bob   30         IT   60000
2  103  Charlie   22    Finance   55000
3  104    David   28  Marketing   58000

In [23]:
df[:]

    ID     Name  Age Department  Salary
0  101    Alice   25         HR   50000
1  102      Bob   30         IT   60000
2  103  Charlie   22    Finance   55000
3  104    David   28  Marketing   58000
4  105     Emma   27      Sales   62000

In [25]:
df.columns

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [27]:
df.Name

0      Alice
1        Bob
2    Charlie
3      David
4       Emma
Name: Name, dtype: object

In [29]:
df["Salary"]

0    50000
1    60000
2    55000
3    58000
4    62000
Name: Salary, dtype: int64

In [31]:
type(df["Name"])

pandas.core.series.Series

In [33]:
df[["Name", "Salary"]]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   58000
4     Emma   62000

In [37]:
df.Salary.max()

62000

In [41]:
df["Salary"].min()

50000

In [43]:
df["Salary"].mean()

57000.0

In [45]:
df["Salary"].std()

4690.41575982343

In [47]:
df.describe()

               ID       Age       Salary
count    5.000000   5.00000      5.00000
mean   103.000000  26.40000  57000.00000
std      1.581139   3.04959   4690.41576
min    101.000000  22.00000  50000.00000
25%    102.000000  25.00000  55000.00000
50%    103.000000  27.00000  58000.00000
75%    104.000000  28.00000  60000.00000
max    105.000000  30.00000  62000.00000

In [49]:
df[df.Salary == df.Salary.max()]

    ID  Name  Age Department  Salary
4  105  Emma   27      Sales   62000

In [53]:
df[["Name", "Salary"]][df.Salary == df.Salary.max()]

   Name  Salary
4  Emma   62000

In [57]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [59]:
df.set_index(["Name"], inplace = True)#Modifying the original dataframe

In [61]:
df

          ID  Age Department  Salary
Name
Alice    101   25         HR   50000
Bob      102   30         IT   60000
Charlie  103   22    Finance   55000
David    104   28  Marketing   58000
Emma     105   27      Sales   62000

In [65]:
df.reset_index(inplace = True)

In [67]:
df

   index     Name   ID  Age Department  Salary
0      0    Alice  101   25         HR   50000
1      1      Bob  102   30         IT   60000
2      2  Charlie  103   22    Finance   55000
3      3    David  104   28  Marketing   58000
4      4     Emma  105   27      Sales   62000

In [71]:
df.loc[1]#Locating a particular data

index             1
Name            Bob
ID              102
Age              30
Department       IT
Salary        60000
Name: 1, dtype: object

In [ ]:
#Try to set the index as the primary key of the dataframe